/**
 ****************************************************************************************************
 * @file        mpu.h
 * @version     V1.0
 * @brief       MPU内存保护 驱动代码
 ****************************************************************************************************
 * @attention   Waiken-Smart 慧勤智远
 *
 * 实验平台:    STM32H743VIT6小系统板
 *
 ****************************************************************************************************
 */
 
#ifndef __MPU_H
#define __MPU_H

#include "./SYSTEM/sys/sys.h"


/******************************************************************************************/

uint8_t mpu_set_protection(uint32_t baseaddr, uint32_t size, uint32_t rnum, uint8_t de, uint8_t ap, uint8_t sen, uint8_t cen, uint8_t ben);   /* 设置某个区域的MPU保护 */
void mpu_memory_protection(void);   /* 设置需要保护的存储块 */

#endif




